snlkuharlocal/src/InformationRegisters/ЗадачиОтложеннойОбработкиДокументов/ЗадачиОтложеннойОбработкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиОтложеннойОбработкиДокументов</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЧастей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбработаноЧастей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ошибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Задачи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПланНабора</types>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>EnumRef.ЗадачиОтложеннойОбработкиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ОчередьЗадач/ОчередьЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьЗадач</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОчереди</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗадания</name>
    <type>
      <types>EnumRef.СостоянияФЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>пОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполняющееФЗ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска_План</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска_Факт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ошибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Успешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбъектов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Процесс</name>
    <type>
      <types>CatalogRef.ПроцессыОбработкиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксЧислоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПопытки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаОбработки</name>
    <type>
      <types>CatalogRef.ЗадачиОбработкиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ЗадачиВладельца</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИД_Задачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЧасти</name>
    <comment>map_index</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ЗадачиОтложеннойОбработкиДокументов/ЗадачиОтложеннойОбработкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗадачиОтложеннойОбработкиДокументов</name>
  <enumValues>
    <name>ОтправитьВЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ПолучитьРезультатыЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнитьСоставНаборов</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнитьСоставАгрегаций</name>
  </enumValues>
  <enumValues>
    <name>ИзмененитьСтатусНакладной</name>
  </enumValues>
  <enumValues>
    <name>ЗаписатьОтложенныеДвижения</name>
  </enumValues>
  <enumValues>
    <name>ПровестиДокумент</name>
  </enumValues>
  <enumValues>
    <name>ПроверитьКодыВЧЗ</name>
    <comment>Проверить коды маркировки документа в честном знаке</comment>
  </enumValues>
  <enumValues>
    <name>ПланНабора_ЗаписатьВремяСканирования</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ПроцессыОбработкиДанных/ПроцессыОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПроцессыОбработкиДанных</name>
  <comment>DAG</comment>
  <predefined>
    <items>
      <name>ПроверкаЧЗ</name>
      <description>Проверка ЧЗ</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаВыполнения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Задачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.ЗадачиОбработкиДанных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/InformationRegisters/ЗадачиОтложеннойОбработкиДокументов/ManagerModule.bsl
Функция СоздатьЗадачу(Документ, Задача, ДопПараметры = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Результат.Ошибки.Добавить("Не указан обрабатываемый документ !");	
		Возврат Результат;
	КонецЕсли;
	
	ТекПриоритеты = ПолучитьТекущиеПриоритеты(Документ);           
	
	Порядок 			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Порядок", 1);
	ПараметрыОбработки	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ПараметрыОбработки");
	Статус				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Статус", Перечисления.СтатусыДокументовМаркировки.КОбработке);
	//+++Чирков 01.06.2026 MARK-3589
	Перезапускать		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Перезапускать", Ложь);
	//---Чирков 01.06.2026
	
	МЗ = РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.СоздатьМенеджерЗаписи();
	
	МЗ.Документ = Документ;
	МЗ.Задача	= Задача;
	
	Если НЕ ЗначениеЗаполнено(МЗ.Документ) Тогда		
		Результат.Ошибки.Добавить("Не поддерживаемый вид документа: " + ТипЗнч(Документ));
		Возврат Результат;
	КонецЕсли;
		
	МЗ.Прочитать();
	
	//+++Чирков 01.06.2026 MARK-3589
	СоздатьОбновитьЗадачу = Истина;
	Если ЗначениеЗаполнено(МЗ.Документ) Тогда
		Если Перезапускать <> Истина Тогда
			Результат.Успешно = Ложь;		
			Результат.Ошибки.Добавить("Задача уже существует !");
			
			СоздатьОбновитьЗадачу = Ложь;
		Иначе			
			МЗ.ИД_Задачи = Неопределено;			
		КонецЕсли;		
	КонецЕсли;
	
	Если СоздатьОбновитьЗадачу Тогда
	//---Чирков 01.06.2026
		МЗ.Документ = Документ;
		МЗ.Задача	= Задача;
		
		Если Порядок >= 0 Тогда
			МЗ.Порядок = ТекПриоритеты.ПорядокМакс + 1;
		ИначеЕсли Порядок < 0 Тогда                      
			МЗ.Порядок = ТекПриоритеты.ПорядокМин - 1;						
		КонецЕсли;		
		
		МЗ.Статус		= Статус;
		
		МЗ.Автор		= ПараметрыСеанса.Пользователь;	
		МЗ.ДатаСоздания	= ТекущаяДата();
		
		Если ПараметрыОбработки <> Неопределено Тогда
			МЗ.ПараметрыОбработки	= Новый ХранилищеЗначения(ПараметрыОбработки);		
		КонецЕсли;		
		
		МЗ.Записать();
		Результат.Успешно = Истина;		
	КонецЕсли;                                                             
	
	Возврат Результат;
КонецФункции //Функция СоздатьЗадачу(Документ, Задача, ДопПараметры = Неопределено) Экспорт

Функция ВыполнитьЗадачу(Документ, Задача, ДопПараметры = Неопределено) Экспорт
	
	Если Задача = Перечисления.ЗадачиОтложеннойОбработкиДокументов.ЗаполнитьСоставНаборов Тогда
		Результат = Документы.МаркировкаТоваровИСМП.ПроверитьЗаполнитьСоставКодовНабора(Документ);	
	КонецЕсли;
	
КонецФункции //ВыполнитьЗадачу(Документ, Задача, ДопПараметры = Неопределено) Экспорт

Функция ЗапланироватьВыполнениеЗадач() Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Документ,	
	|	МИНИМУМ(Порядок) КАК Порядок
	|ПОМЕСТИТЬ ВТ_ЗадачиКИсполнению
	|ИЗ
	|	РегистрСведений.ЗадачиОтложеннойОбработкиДокументов
	|ГДЕ
	|	Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.КОбработке)
	|СГРУППИРОВАТЬ ПО
	|	Документ	
	|;
	|ВЫБРАТЬ
	|	ВТ_ЗадачиКИсполнению.Документ 	КАК Документ,	
	|	МАКСИМУМ(ВсеЗадачи.Порядок) 	КАК Порядок
	|ПОМЕСТИТЬ ВТ_ПредыдущиеЗадачи
	|ИЗ
	|	ВТ_ЗадачиКИсполнению
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЗадачиОтложеннойОбработкиДокументов КАК ВсеЗадачи
	|ПО
	|	ВсеЗадачи.Документ = ВТ_ЗадачиКИсполнению.Документ
	|	И ВсеЗадачи.Порядок < ВТ_ЗадачиКИсполнению.Порядок
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗадачиКИсполнению.Документ
	|;         
	|ВЫБРАТЬ 
	|	ВТ_ПредыдущиеЗадачи.Документ	КАК Документ,
	|	МАКСИМУМ(ВсеЗадачи.Статус) 		КАК Статус
	|ПОМЕСТИТЬ ВТ_СтатусыПредудыщихЗадач
	|ИЗ
	|	ВТ_ПредыдущиеЗадачи
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЗадачиОтложеннойОбработкиДокументов КАК ВсеЗадачи
	|ПО
	|	ВсеЗадачи.Документ = ВТ_ПредыдущиеЗадачи.Документ
	|	И ВсеЗадачи.Порядок = ВТ_ПредыдущиеЗадачи.Порядок
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПредыдущиеЗадачи.Документ
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|ВЫБРАТЬ	
	|	ВТ_ЗадачиКИсполнению.Документ	КАК Документ,
	|	ВсеЗадачи.Задача				КАК Задача,
	|	ВсеЗадачи.ПараметрыОбработки 	КАК ПараметрыОбработки 
	|ИЗ
	|	ВТ_ЗадачиКИсполнению	
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЗадачиОтложеннойОбработкиДокументов КАК ВсеЗадачи
	|ПО
	|	ВТ_ЗадачиКИсполнению.Документ	= ВсеЗадачи.Документ	
	|	И ВТ_ЗадачиКИсполнению.Порядок	= ВсеЗадачи.Порядок
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВТ_СтатусыПредудыщихЗадач
	|ПО
	|	ВТ_СтатусыПредудыщихЗадач.Документ = ВТ_ЗадачиКИсполнению.Документ
	|	И (
	|		ВТ_СтатусыПредудыщихЗадач.Статус ЕСТЬ NULL 
	|		ИЛИ ВТ_СтатусыПредудыщихЗадач.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан)
	|	)	
	|";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Документ	= Выборка.Документ;
		Задача	 	= Выборка.Задача;
		
		пВыполнения = МетодВыполненияЗадачи(Задача);
		Метод 		= МаркировкаКС.ПолучитьЗначениеПараметра(пВыполнения, "Метод");
		
		Если ЗначениеЗаполнено(Метод) Тогда
			
			пОбработки  = Выборка.ПараметрыОбработки.Получить();
			
			НачатьТранзакцию();
			Попытка				
				ПоставитьЗадачуВОчередь(Задача, Документ, Метод, пОбработки);
				ЗаписатьСтатус(Задача, Документ, Перечисления.СтатусыДокументовМаркировки.Обрабатывается);			
				
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				
				ТекстСообщения = СтрШаблон("Ошибка помещения док-та в очередь обработки ! %1", ОписаниеОшибки());
				ЗаписатьВЛог("Оложенная обработка док-ов", ТекстСообщения, "Ошибка");
			КонецПопытки;
		Иначе
			ТекстСообщения = СтрШаблон("Не задан метод обработки задачи: %1. Док-т: %2.", Задача, Документ);
			ЗаписатьВЛог("Оложенная обработка док-ов", ТекстСообщения, "Ошибка");			
		КонецЕсли;		
	КонецЦикла;
КонецФункции //ЗапланироватьВыполнениеЗадач()

Функция МетодВыполненияЗадачи(Задача)
	Результат 	= Новый Структура;
	Метод		= "";
	Если Задача = Перечисления.ЗадачиОтложеннойОбработкиДокументов.ЗаполнитьСоставАгрегаций Тогда
		Метод = "Документы.МаркировкаТоваровИСМП.ПроверитьЗаполнитьСоставАгрегационныхКодов";
	ИначеЕсли Задача = Перечисления.ЗадачиОтложеннойОбработкиДокументов.ЗаполнитьСоставНаборов Тогда
		Метод = "Документы.МаркировкаТоваровИСМП.ПроверитьЗаполнитьСоставКодовНабора";
	ИначеЕсли Задача = Перечисления.ЗадачиОтложеннойОбработкиДокументов.ПроверитьКодыВЧЗ Тогда
		Метод = "МаркировкаС.ПроверитьКМпоДокументу";		
		
		Результат.Вставить("ЗадачаОбработки", 	Справочники.ЗадачиОбработкиДанных.ПроверкаКМвЧЗ);
		Результат.Вставить("Процесс", 			Справочники.ПроцессыОбработкиДанных.ПроверкаЧЗ);
	КонецЕсли;
	
	Результат.Вставить("Метод", Метод);	
	
	Возврат Результат;
КонецФункции //МетодВыполненияЗадачи(Задача)

Функция ПолучитьПараметрыМетода(Задача, Документ, пОбработки = Неопределено)
	//+++Чирков 01.06.2026 MARK-3589
	//Возврат Новый Структура("ДокСсылка", Документ);
	Результат = Новый Структура("ДокСсылка", Документ);
	Если Задача = Перечисления.ЗадачиОтложеннойОбработкиДокументов.ПроверитьКодыВЧЗ Тогда		
		ПорцииКМ = Новый Массив;
		ПорцииКМ.Добавить(пОбработки);
		
		ДопПараметры = Новый Структура("ПорцииКМ,ВызовИзЗадачи", ПорцииКМ, Истина);
		
		Результат.Вставить("ДопПараметры", 	ДопПараметры);
	КонецЕсли;
	Возврат Результат;
	//---Чирков
КонецФункции //ПолучитьПараметрыМетода(Задача, ДокСсылка, пОбработки = Неопределено)

Функция ПолучитьПараметрыВыполненияЗадачи(Задача)
	Результат = Неопределено;
	Если Задача = Перечисления.ЗадачиОтложеннойОбработкиДокументов.ПроверитьКодыВЧЗ Тогда
		Результат = Справочники.ЗадачиОбработкиДанных.ПроверкаКМвЧЗ;			
	КонецЕсли;                                                      
	Возврат Результат;
КонецФункции //ПолучитьПараметрыВыполненияЗадачи(Задача)

Функция ПоставитьЗадачуВОчередь_OLD(Задача, Документ, Метод, Знач пОбработки)
	Если пОбработки = Неопределено Тогда
		пОбработки = Новый Структура;	
	КонецЕсли;	
	
	пМетода = ПолучитьПараметрыМетода(Задача, Документ, пОбработки);
	пОбработки.Вставить("ПараметрыМетода", пМетода);
	
	рСоздания = РегистрыСведений.ОчередьЗадач.СоздатьЗадачу(Метод, "Отложенная обработка док-ов", Документ, пОбработки);
	Если рСоздания.Успешно Тогда
		ЗаписатьИД_Задачи(Задача, Документ, рСоздания.Данные);
	КонецЕсли;
КонецФункции //ПоставитьЗадачуВОчередь(Документ, Метод, пОбработки)

Функция ПоставитьЗадачуВОчередь(Задача, Документ, Метод, Знач пОбработки)
	Если пОбработки = Неопределено Тогда
		пОбработки = Новый Структура;	
	КонецЕсли;	
	
	ПараллельноеВыполнение	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ПараллельноеВыполнение", Ложь);
	ПараметрыВыполнения		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ПараметрыВыполнения");
	
	Если ПараллельноеВыполнение Тогда
		мПараметрыПорций = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ПараметрыПорций", Новый Массив);		
	Иначе                                                                                                       
		мПараметрыПорций = Новый Массив;
	КонецЕсли;
	
	Если мПараметрыПорций.Количество() = 0 Тогда
		Если ТипЗнч(пОбработки) = Тип("Массив") Тогда
			мПараметрыПорций.Добавить(пОбработки);
		//+++Чирков 24.06.2026 0000001932	
		Иначе                                     
			мПараметрыПорций.Добавить(Неопределено);			
		//---Чирков 24.06.2026
		КонецЕсли;
	КонецЕсли;
	
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ИД_Задачи = Неопределено;
	
	НомерЧасти = 0;
	
	Для каждого пПорции Из мПараметрыПорций Цикл		
		пМетода = ПолучитьПараметрыМетода(Задача, Документ, пПорции);
		
		//+++Чирков 01.06.2026 MARK-3589
		пСоздания = Новый Структура("ПараметрыМетода,ПараметрыВыполнения,НомерЧасти,ИД_ЗадачиВладельца,ЗадачаОбработки", 
			пМетода, ПараметрыВыполнения, НомерЧасти, ИД_Задачи, ПолучитьПараметрыВыполненияЗадачи(Задача));
		Если ТипЗнч(пПорции) = Тип("Массив") Тогда
			пСоздания.Вставить("КоличествоОбъектов", пПорции.Количество());
		КонецЕсли;
		//рСоздания = РегистрыСведений.ОчередьЗадач.СоздатьЗадачу(Метод, "Отложенная обработка док-ов", Документ, Новый Структура("ПараметрыМетода,ПараметрыВыполнения,НомерЧасти,ИД_ЗадачиВладельца", пМетода, ПараметрыВыполнения, НомерЧасти, ИД_Задачи));
		рСоздания = РегистрыСведений.ОчередьЗадач.СоздатьЗадачу(Метод, "Отложенная обработка док-ов", Документ, пСоздания);
		//---Чирков
		
		Если рСоздания.Успешно Тогда
			Если ИД_Задачи = Неопределено Тогда
				ИД_Задачи = рСоздания.Данные;
				ЗаписатьИД_Задачи(Задача, Документ, рСоздания.Данные);
			КонецЕсли;			
			НомерЧасти = НомерЧасти + 1;
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рСоздания);
		КонецЕсли;
	КонецЦикла;	    
	
	Возврат Результат;
КонецФункции //ПоставитьЗадачуВОчередь(Документ, Метод, пОбработки)

Функция ЗаписатьСтатус(Задача, Документ, Статус, ДопЗначенияПолей = Неопределено)
	Запись = РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.СоздатьМенеджерЗаписи();
	
	Запись.Документ = Документ;
	Запись.Задача	= Задача;
	
	Запись.Прочитать();
	
	Если ЗначениеЗаполнено(Запись.Документ) Тогда
		Запись.Статус = Статус;
		
		Если ТипЗнч(ДопЗначенияПолей) = Тип("Структура") Тогда
			Для каждого КиЗ Из ДопЗначенияПолей Цикл
				Запись[КиЗ.Ключ] = КиЗ.Значение;			
			КонецЦикла;		
		КонецЕсли;
	КонецЕсли;
	
	Запись.Записать();
КонецФункции //ЗаписатьСтатус(Задача, Документ, Статус)

Функция ЗаписатьИД_Задачи(Задача, Документ, ИД_Задачи)
	Запись = РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.СоздатьМенеджерЗаписи();
	
	Запись.Документ = Документ;
	Запись.Задача	= Задача;
	
	Запись.Прочитать();
	
	Если ЗначениеЗаполнено(Запись.Документ) Тогда
		Запись.ИД_Задачи = ИД_Задачи; 			
	КонецЕсли;
	
	Запись.Записать();
КонецФункции //ЗаписатьИД_Задачи(Задача, Документ, ИД_Задачи)

Функция ПолучитьТекущиеПриоритеты(Документ)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	МИНИМУМ(Порядок) КАК ПорядокМин,
	|	МАКСИМУМ(Порядок) КАК ПорядокМакс
	|ИЗ
	|	РегистрСведений.ЗадачиОтложеннойОбработкиДокументов
	|ГДЕ
	|	Документ = &Документ
	|";
	
	Запрос.УстановитьПараметр("Документ", Документ);		
	
	ПорядокМин	= 0;
	ПорядокМакс = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ПорядокМин) Тогда
			ПорядокМин 	= Выборка.ПорядокМин;
			ПорядокМакс	= Выборка.ПорядокМакс;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("ПорядокМин,ПорядокМакс", ПорядокМин, ПорядокМакс);
КонецФункции //ПолучитьТекущиеПриоритеты(Документ)

Функция ОбновитьСтатусыЗадач() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Документ,
	|	Задача,
	|	ИД_Задачи
	|ПОМЕСТИТЬ ВТ_АктивныеЗадачи	
	|ИЗ
	|	РегистрСведений.ЗадачиОтложеннойОбработкиДокументов
	|ГДЕ
	|	Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обрабатывается)	
	|	И ИД_Задачи <> &ПустойУИД
	|ИНДЕКСИРОВАТЬ ПО
	|	ИД_Задачи
	|;
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|(	
	|ВЫБРАТЬ
	|	Задачи.Документ 		КАК Документ,
	|	Задачи.Задача	 		КАК Задача,
	|	Задачи.ИД_Задачи 		КАК ИД_Задачи,
    |
	|	Очередь.НомерЧасти		КАК НомерЧасти,
	|	Очередь.ДатаЗавершения  КАК ДатаЗавершения,
	|	Очередь.Успешно			КАК Успешно,
	|	Очередь.Ошибки			КАК Ошибки,
	|	Очередь.Автор			КАК Исполнитель		
	|ИЗ
	|	ВТ_АктивныеЗадачи КАК Задачи
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОчередьЗадач КАК Очередь
	|ПО   		
	|	Задачи.ИД_Задачи = Очередь.ИД_Задачи
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	Задачи.Документ 		КАК Документ,
	|	Задачи.Задача	 		КАК Задача,
	|	Задачи.ИД_Задачи 		КАК ИД_Задачи,
    |
	|	Очередь.НомерЧасти		КАК НомерЧасти,
	|	Очередь.ДатаЗавершения  КАК ДатаЗавершения,
	|	Очередь.Успешно			КАК Успешно,
	|	Очередь.Ошибки			КАК Ошибки,
	|	Очередь.Автор			КАК Исполнитель		
	|ИЗ
	|	ВТ_АктивныеЗадачи КАК Задачи
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОчередьЗадач КАК Очередь
	|ПО   		
	|	Задачи.ИД_Задачи = Очередь.ИД_ЗадачиВладельца	
	|) КАК Сводный
	|УПОРЯДОЧИТЬ ПО
	|	Документ,Задача,НомерЧасти,ДатаЗавершения УБЫВ 
	|ИТОГИ ПО 
	|	Документ,Задача
	|";
	
	Запрос.УстановитьПараметр("ПустойУИД", ПустойУИД());
	
	Выборка_Документ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Документ");
	Пока Выборка_Документ.Следующий() Цикл
		Выборка_Задача = Выборка_Документ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Задача");	
		Пока Выборка_Задача.Следующий() Цикл
			Выборка = Выборка_Задача.Выбрать();			
			
			ВсеЧастиОбработаны 	= Истина;
			ВсеЧастиУспешно		= Истина;
			Ошибки 				= Новый Массив;			            
			ДатаЗавершения 		= '19800101';
			
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.ДатаЗавершения) Тогда
					ДатаЗавершения = Макс(ДатаЗавершения, Выборка.ДатаЗавершения);
					Если Выборка.Успешно Тогда
												
					Иначе
						ВсеЧастиУспешно = Ложь;					
						Если ЗначениеЗаполнено(Выборка.Ошибки) Тогда
							ТекстОшибки = СтрШаблон("Ошибки подзадачи: %1: %2.", Выборка.НомерЧасти, Выборка.Ошибки);
							Ошибки.Добавить(ТекстОшибки);
						КонецЕсли;
					КонецЕсли;
				Иначе					
					ВсеЧастиОбработаны = Ложь;									
				КонецЕсли;				
			КонецЦикла;
			
			Если ВсеЧастиОбработаны Тогда
				Статус = ?(ВсеЧастиУспешно, Перечисления.СтатусыДокументовМаркировки.Обработан, Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки);				
				ЗаписатьСтатус(Выборка_Задача.Задача, Выборка_Задача.Документ, Статус, Новый Структура("ДатаОбработки,Ошибки", ДатаЗавершения, СтрСоединить(Ошибки, Символы.ПС)));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецФункции //ОбновитьСтатусыЗадач() Экспорт
